{
  "title": "Seller Management System – UI Revamp",
  "description": "This PRD defines a UI-only refresh for the existing internal Seller Management System. All functionality, data flow, and business logic are already implemented and must remain unchanged. The goal is to improve visual clarity, consistency, and usability using shadcn/ui components.",
  "scope": "ui-only",
  "ui_standard": "shadcn/ui",
  "constraints": [
    "Do not modify backend logic, APIs, or database schema",
    "Do not introduce new features or remove existing functionality",
    "All changes must be limited to UI and layout"
  ],
  "ui_goals": [
    "Make the interface visually clean and modern",
    "Improve readability for dense operational data",
    "Reduce cognitive load for account managers",
    "Ensure consistent spacing, typography, and interaction patterns"
  ],
  "ui_changes": [
    {
      "area": "Global Layout",
      "status": "COMPLETE",
      "requirements": [
        "Introduce a consistent page layout with header, content area, and optional sidebar",
        "Apply consistent spacing and alignment across all pages",
        "Use shadcn/ui layout patterns and Tailwind utilities"
      ]
    },
    {
      "area": "Seller List",
      "status": "COMPLETE",
      "requirements": [
        "Render seller list using shadcn/ui Table component",
        "Use clear column headers and row spacing",
        "Add subtle hover and focus states for rows",
        "Ensure long text is truncated with tooltips where necessary"
      ]
    },
    {
      "area": "Seller Profile Page",
      "status": "COMPLETE",
      "requirements": [
        "Split seller profile into clearly defined sections (Details, Documents, Payments, Notes)",
        "Use shadcn/ui Card components to group related information",
        "Maintain consistent section headings and spacing"
      ]
    },
    {
      "area": "Document List UI",
      "status": "COMPLETE",
      "requirements": [
        "Display documents in a structured table layout",
        "Columns must include file name, tag, and link",
        "Use shadcn/ui Badge component for document tags",
        "Use shadcn/ui Button or Link styling for clickable document links"
      ]
    },
    {
      "area": "Forms",
      "status": "COMPLETE",
      "requirements": [
        "Refactor all forms to use shadcn/ui Form, Input, Select, and Textarea components",
        "Ensure consistent label placement and validation messaging",
        "Clearly indicate optional fields"
      ]
    },
    {
      "area": "Notes & Text Fields",
      "status": "COMPLETE",
      "requirements": [
        "Use shadcn/ui Textarea for note fields",
        "Ensure adequate height and spacing for readability",
        "Maintain visual separation from other form elements"
      ]
    },
    {
      "area": "Feedback & States",
      "status": "COMPLETE",
      "requirements": [
        "Use shadcn/ui components for loading states, empty states, and error states",
        "Display clear empty-state messages when no data is present",
        "Avoid raw browser alerts"
      ]
    }
  ],
  "visual_guidelines": [
    "Prefer neutral color palette with subtle accents",
    "Use consistent typography scale",
    "Avoid dense, ungrouped information blocks",
    "UI should feel professional and efficient rather than decorative"
  ],
  "non_goals": [
    "Changing workflows or business rules",
    "Adding animations beyond subtle transitions",
    "Introducing public-facing design elements"
  ],
  "success_criteria": [
    "All screens use shadcn/ui components consistently",
    "UI is visually cleaner and easier to scan than before",
    "No functional or behavioral regressions are introduced",
    "Account managers can perform the same tasks with improved clarity"
  ]
}
