{
  "title": "Seller Management System – Document & Seller Detail Enhancements",
  "description": "This PRD defines incremental changes to the existing internal Seller Management System. It covers only newly requested behavior and modifications and assumes all previously defined and implemented functionality remains unchanged.",
  "scope": "change-only",
  "ui_standard": "shadcn/ui",
  "changes": [
    {
      "area": "Document Management",
      "status": "COMPLETE",
      "problem": "Documents are now stored in Google Drive, but the UI and data model do not clearly represent this.",
      "requirements": [
        "Documents must be represented only as Google Drive references.",
        "Each document record must store and display the following fields: file name, tag, and Google Drive link.",
        "Document links must be clickable and open in a new browser tab.",
        "The document list must be displayed in a clear, structured layout suitable for frequent internal use."
      ],
      "explicit_removals": [
        "One-time upload link functionality - REMOVED",
        "Any UI or logic related to external file uploads - REMOVED"
      ],
      "ui_expectations": [
        "Use shadcn/ui Table or List components to render document lists",
        "Tags should be visually represented using shadcn/ui Badge components"
      ]
    },
    {
      "area": "Seller Creation & Editing",
      "problem": "Seller records do not currently capture ownership and service context clearly.",
      "requirements": [
        "While creating or editing a seller, allow optional Account Manager information to be captured.",
        "Account Manager details must include name, mobile number, and email address.",
        "Account Manager information must not be mandatory and must not block seller creation."
      ],
      "ui_expectations": [
        "Account Manager fields should be grouped logically using shadcn/ui Form components",
        "Optional fields should be clearly marked as optional"
      ]
    },
    {
      "area": "Service Context",
      "problem": "There is no single place to capture what services are being offered to a seller.",
      "requirements": [
        "Add a single free-text note field on the seller profile for capturing service name(s).",
        "The field should accept plain text and be editable after seller creation."
      ],
      "ui_expectations": [
        "Use a shadcn/ui Textarea component",
        "Field should be placed prominently within the seller profile"
      ]
    }
  ],
  "non_goals": [
    "Reworking existing seller flows",
    "Introducing external user access",
    "Adding new storage providers",
    "Refactoring unrelated UI or backend logic"
  ],
  "success_criteria": [
    "Users can view a clean, readable list of Google Drive documents with name, tag, and link",
    "One-time upload links are fully removed from the system",
    "Account Manager details can be optionally added to sellers",
    "Service names can be captured in a dedicated seller note field",
    "UI changes consistently use shadcn/ui components and appear visually polished"
  ]
}
